package main //Задача. Определить сумму покупки.
// По любому можно сделать эту задачу без второго массива. Посмотреть про поля или каты или еще что-нибудь

import (
	"fmt"
)

var (
	goods                 = [...]string{"Огурцы", "Помидоры", "Яблоки", "Лимоны", "Апельсины", "Бананы", "Мандарины", "Груши", "Курица", "Сыр", "Укроп", "Петрушка", "Масло", "Молоко", "Сахар", "Чай", "Виноград"}
	price                 = [...]float64{77.50, 180, 95.70, 233, 99.99, 67, 117, 200, 235.70, 473.85, 23, 18, 178.40, 67, 54, 80, 145}
	weight, sum, discount float64
	j                     int = 20
)

func main() {
	for i, v := range goods {
		fmt.Println(i+1, "- ", v, "- ", price[i])
	}
	for j != 0 {
		fmt.Print("Введите номер товара или 0 для завершения покупок: ")
		fmt.Scanln(&j)
		if j != 0 {
			fmt.Print("Вы выбрали ", goods[j-1], " Введите необходимый вес или количество: ")
			fmt.Scanln(&weight)
			sum = sum + weight*price[j-1]
		}
	}
	fmt.Println("Всего покупок на ", sum, "руб.")
}
